# PlasticvinylPatternAmount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlasticVinyl..::..PlasticvinylPatternAmount Property
PlasticVinyl Class See Also
---
The property labeled "Amount" from the "PlasticVinyl" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string PlasticvinylPatternAmount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlasticvinylPatternAmount As String
	Get
```

Visual C++
---
```text
public:
static property String^ PlasticvinylPatternAmount {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".
# See Also
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace